{
    "questions": {
        "1": [
            {
                "idx": "01",
                "question": "What is the name of the city where I was born? (Does not include its parent name)"
            },
            {
                "idx": "02",
                "question": "What is the full name of the hospital where I was born?"
            },
            {
                "idx": "03",
                "question": "What was the time of my birth? (for example, at 13:31)"
            },
            { "idx": "04", "question": "What's my dad's full name?" },
            { "idx": "05", "question": "What's my mother's full name?" },
            {
                "idx": "06",
                "question": "What are my parents' full names? (Separated by commas)"
            },
            {
                "idx": "07",
                "question": "What is the full name of my first child?"
            }
        ],
        "2": [
            {
                "idx": "01",
                "question": "What is the full name of the teacher who left the deepest impression on you during your elementary school days?"
            },
            {
                "idx": "02",
                "question": "What is the full name of the most impressive teacher in junior high school?"
            },
            {
                "idx": "03",
                "question": "What is the full name of the most impressive teacher in high school?"
            },
            {
                "idx": "04",
                "question": "What is the full name of the most impressive teacher in college?"
            },
            {
                "idx": "05",
                "question": "What is the full name of the closest classmate in primary school?"
            },
            {
                "idx": "06",
                "question": "What is the full name of the most closely related students in junior high school?"
            },
            {
                "idx": "07",
                "question": "What is the full name of your closest classmate in high school?"
            },
            {
                "idx": "08",
                "question": "What is the full name of the classmate who is closest to you in college?"
            },
            {
                "idx": "09",
                "question": "What is the full name of the first classmate you know when you just entered junior high school?"
            },
            {
                "idx": "10",
                "question": "What was the full name of the first classmate you met when you first entered high school?"
            },
            {
                "idx": "11",
                "question": "What was the full name of the first classmate you met when you first entered the university?"
            },
            {
                "idx": "12",
                "question": "What is the full name of the first teacher who taught me when I first entered primary school?"
            },
            {
                "idx": "13",
                "question": "What is the full name of the first teacher who gave me a class when I first entered junior high school?"
            },
            {
                "idx": "14",
                "question": "What was the full name of the first teacher who taught me when I first entered high school?"
            },
            {
                "idx": "15",
                "question": "What was the full name of the first teacher who taught me when I first entered college?"
            }
        ],
        "3": [
            {
                "idx": "01",
                "question": "xxx?"
            }
        ]
    }
}
